# read_verilog ./half-adder.v
read_verilog ./test1.v
prep -top test
# elaborate design hierarchy
hierarchy -check -top test


# mapping flip-flops to mycells.lib
dfflibmap -liberty ./mycells-not-working.lib
techmap;  # opt
# mapping logic to mycells.lib
abc -liberty mycells-not-working.lib
# write into an "abc" techmap design 
# then read + flatten to get a design with XORs
read_verilog ./mycells-not-working.v
# read_verilog synth.v
# prep -top full_adder
flatten;
write_verilog test1_synth.v
write_lakeroad test1.egg
