# read design
read_verilog full_adder.v half_adder.v
flatten;
synth -top full_adder;


# write_verilog synth.v
write_lakeroad
