# read design
read_verilog counter.v
synth -top counter

# dfflibmap -liberty mycells.lib
# abc -liberty mycells.lib

# clean
# write synthesized design
# TODO I need to figure out how to write firrtl
# write_verilog synth.v
write_btor synth.btor