# read design
read_verilog half-adder.v
synth -top half_adder

# dfflibmap -liberty mycells.lib
# abc -liberty mycells.lib

# clean

# write synthesized design
# TODO I need to figure out how to write firrtl
# write_verilog synth-half-adder.v
# write_blif synth.blif
# write_btor synth-half-adder.btor
