# read design
# read_verilog synth.v
read_verilog full_adder.v half_adder.v
hierarchy -top full_adder; 

flatten;
# synth -top full_adder;


write_verilog synth.v
write_lakeroad
