# read_verilog -sv ./decoder.sv
# read_verilog -sv ./alu.sv
# read_verilog -sv ./top.sv
read_verilog -sv ./myand.sv
prep -top myand;
hierarchy -check -top myand;

dfflibmap -liberty ./mycells.lib
techmap;  opt;
flatten;
abc -liberty mycells.lib
read_verilog ./mycells.v;
flatten
# write_verilog synth.v
write_lakeroad myand.egg
